InformationRegisters/ВыполняемыйКодВБазах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ВыполняемыйКодВБазах</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыполняемыйКодВБазах/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область СобытияФормы
#КонецОбласти

#Область СобытияЭлементовФормы
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущийЭлемент.Имя = "Статус" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьДействиеВопрос", ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Элементы.Список.ТекущиеДанные)),
			"Выполнить действие?", 
			РежимДиалогаВопрос.ДаНет
		);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВыполнение(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьДействиеВопрос", ЭтотОбъект, Элементы.Список.ВыделенныеСтроки),
		"Выполнить действие?",
		РежимДиалогаВопрос.ДаНет
	);	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписи(Команда)
	ОткрытьФорму("РегистрСведений.ВыполняемыйКодВБазах.Форма.ФормаСоздания");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьДействиеВопрос(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ДлительнаяОперация = НачатьВыполнениеНаСервере(ДопПараметры);
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);	
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция НачатьВыполнениеНаСервере(ДопПараметры)
	
	Массив = Новый Массив;
	Для Каждого Эл Из ДопПараметры Цикл
		
		Эл1 = Неопределено;
		Если ТипЗнч(Эл) = Тип("РегистрСведенийКлючЗаписи.ВыполняемыйКодВБазах") Тогда
			Эл1 = ПолучитьЗаписьПоКлючу(Эл);
		Иначе
			Эл1 = Эл;
		КонецЕсли;	
		
		Массив.Добавить(Новый Структура("Период,Организация,Код,Статус", Эл1.Период, Эл1.Организация, Эл1.Код, Эл1.Статус)
		);
	КонецЦикла;	
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "УдаленноеВыполнениеКода.ВыполнитьКодУдаленно", 
		Массив
	);
КонецФункции
	
&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаписьПоКлючу(КлючЗаписи) Экспорт
	
	Запись = РегистрыСведений.ВыполняемыйКодВБазах.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
	Запись.Прочитать();
	
	Возврат Запись;
	
КонецФункции

#КонецОбласти
